In [1]:
import pandas as pd
melb_df = pd.read_csv('data/melb_data.csv', sep=',')

In [2]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], dayfirst=True)

In [3]:
melb_df['WeekdaySale'] = melb_df['Date'].dt.dayofweek

In [17]:
weekend_count = melb_df[melb_df['WeekdaySale'] > 4]['WeekdaySale'].count()
print(weekend_count)

12822

In [4]:
def get_weekend(weekday):
    return 1 if weekday > 4 else 0

melb_df['Weekend'] = melb_df['WeekdaySale'].apply(get_weekend)

In [5]:
melb_df[melb_df['Weekend'] == 1]['Price'].mean()

1081198.6406956792

In [18]:
ufo = pd.read_csv('data/ufo.txt', sep=',')

In [20]:
ufo['Time'] = pd.to_datetime(ufo['Time'])
display(ufo)

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

In [21]:
years = ufo['Time'].dt.year
years.value_counts()

1999    2774
2000    2635
1998    1743
1995    1344
1997    1237
        ...
1936       2
1930       2
1935       1
1934       1
1933       1
Name: Time, Length: 68, dtype: int64

In [23]:
ufo['Date'] = ufo['Time'].dt.date
display(ufo)

,City,Colors Reported,Shape Reported,State,Time,Date
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930-06-01
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930-06-30
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931-02-15
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931-06-01
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933-04-18
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,2000-12-31
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,2000-12-31
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,2000-12-31
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,2000-12-31
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,2000-12-31

In [26]:
diff = ufo[ufo['State'] == 'NV']['Date'].diff()

In [34]:
diff.dt.days.mean()

68.92932862190813

In [11]:
sellers = melb_df['SellerG'].value_counts().nlargest(49).index
melb_df['SellerG'] = melb_df['SellerG'].apply(lambda x: x if x in sellers else 'other')

In [15]:
min_Nelson = melb_df[melb_df['SellerG'] == 'Nelson']['Price'].min()
min_other = melb_df[melb_df['SellerG'] == 'other']['Price'].min()
print(min_Nelson / min_other)

1.297709923664122

In [17]:
mem_start = 2.6
top_suburbs = melb_df['Suburb'].value_counts().nlargest(119).index

In [18]:
melb_df['Suburb'] = melb_df['Suburb'].apply(lambda x: x if x in top_suburbs else 'other')

In [19]:
melb_df['Suburb'] = melb_df['Suburb'].astype('category')

In [21]:
melb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 25 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  category
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  datetime64[ns]
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  float64
 12  Bathroom       13580 non-null  float64
 13  Car            13580 non-null  float64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  float64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  float64
 22  Coordinates    13580 non-null  object
 23  WeekdaySale    13580 non-null  int64
 24  Weekend        13580 non-null  int64
dtypes: category(1), datetime64[ns](1), float64(11), int64(5), object(7)
memory usage: 2.5+ MB